In [1]:
import pandas as pd
import csv
import os
import numpy as np
from sqlalchemy import create_engine
from config import access

In [2]:
csv_path="resources/countries.csv"

In [9]:
countries_df = pd.read_csv(csv_path)

In [10]:
countries_df.head()

  country   latitude  longitude                  name
0      AD  42.546245   1.601554               Andorra
1      AE  23.424076  53.847818  United Arab Emirates
2      AF  33.939110  67.709953           Afghanistan
3      AG  17.060816 -61.796428   Antigua and Barbuda
4      AI  18.220554 -63.068615              Anguilla

In [13]:
countries_df.columns = ['code','lat','long','country']
countries_df.head()

  code        lat       long               country
0   AD  42.546245   1.601554               Andorra
1   AE  23.424076  53.847818  United Arab Emirates
2   AF  33.939110  67.709953           Afghanistan
3   AG  17.060816 -61.796428   Antigua and Barbuda
4   AI  18.220554 -63.068615              Anguilla

In [11]:
# Create Engine for SQL Data
engine = create_engine(f'postgresql://postgres:{access}@localhost/etl_db')
conn= engine.connect()

In [12]:
engine.table_names()

['death_cases', 'countries']

In [14]:
countries_df.to_sql(name='countries', con=engine, if_exists='append', index=False)